# 2주차 스터디

2주차 수업에서는 python의 응용 핵심문법들을 공부하면서 필수 스킬(?)들을 익혀보겠습니다. 그리고 데이터 분석에서 쓰이는 자료형태인 Series와 DataFrame에 대해 알아보겠습니다.<br>

2주차부터는 살짝 어려워집니다:)

#### 2주차 스터디의 목차
- 중첩 for문
- list comprehension
- dictionary 응용
- series
- dataframe

# 중첩 for문

for문(반복문)이 하나 일 때는 for i in range(): 의 형태로 나타낼 수 있었습니다. 하지만 반복하는 변수가 여러 개 일 때는 중첩(다중) for문을 쓰게 됩니다. 중첩 for문은 아래와 같은 형태로 나타낼 수 있습니다.



```python
for i in range(5):
    for j in range(4):
        print(i, j)
```


```python
for i in range(5):
    print(i+1,"번째 반복문","i:",i)
    for j in range(4):
        print("j:",j)
```

In [4]:
for i in range(5):
    print(i+1,"번째 반복문","i:",i)
    for j in range(4):
        print("j:",j)

1 번째 반복문 i: 0
j: 0
j: 1
j: 2
j: 3
2 번째 반복문 i: 1
j: 0
j: 1
j: 2
j: 3
3 번째 반복문 i: 2
j: 0
j: 1
j: 2
j: 3
4 번째 반복문 i: 3
j: 0
j: 1
j: 2
j: 3
5 번째 반복문 i: 4
j: 0
j: 1
j: 2
j: 3

```python
for i in range(5):
    for j in range(4):
        print(i + j, end = " ")
    print()
```

In [109]:
for i in range(5):
    for j in range(4):
        print(i + j, end = " ")
    print()

0 1 2 3
1 2 3 4
2 3 4 5
3 4 5 6
4 5 6 7

# list comprehension(내포)

소프트웨어는 적은 자원으로 높은 효율을 낼 경우 최적화가 잘 되었다고 합니다. 최적화의 척도는 보통, 메모리를 적게 사용하거나 실행시간이 적은 경우를 말합니다. 나중에 데이터 분석을 할 때도 수 많은 데이터들을 처리하고 연산하게 되는데, 메모리 공간의 사용과 실행속도는 매우 중요하겠죠? 또한 어느 코드를 짜든 직관적인 코드와 빠른 실행속도는 도움이 됩니다.

앞서 말한 해결방안으로 python의 list comprehension은 for문과 if문을 한 라인에 작성하여 코드를 직관적으로 만들고, 실행속도를 향상시키는 기법입니다.

#### list comprehension 적용 X 코드

```python
num = [1, 2, 3, 4, 5]
double_num = []
for i in num:
    double_num.append(2*i)
double_num
```

In [14]:
num = [1, 2, 3, 4, 5]
double_num = []
for i in num:
    double_num.append(2*i)
double_num

[2, 4, 6, 8, 10]

```python
num = [1, 2, 3, 4, 5]
square_num = []
for i in num:
    square_num.append(i*i)
square_num
```

In [15]:
num = [1, 2, 3, 4, 5]
square_num = []
for i in num:
    square_num.append(i*i)
square_num

[1, 4, 9, 16, 25]

#### list comprehension 적용 O 코드

- 형태 : 리스트 명 = [표현식 for 변수 in 반복 대상]

```python
num = [1, 2, 3, 4, 5]
double_num = [2*i for i in num]
double_num
```

In [19]:
num = [1, 2, 3, 4, 5]
double_num = [2*i for i in num]
double_num

[2, 4, 6, 8, 10]

```
square_num = [i*i for i in num]
square_num
```

In [20]:
square_num = [i*i for i in num]
square_num

[1, 4, 9, 16, 25]

### list comprehension에 조건(if) 추가하기

#### list comprehension 적용 X 코드

```python
num = [1, 2, 3, 4, 5]
double_odd_num = []
for i in num:
    if (i % 2 == 1):
        double_odd_num.append(2*i)
double_odd_num
```

In [21]:
num = [1, 2, 3, 4, 5]
double_odd_num = []
for i in num:
    if (i % 2 == 1):
        double_odd_num.append(2*i)
double_odd_num

[2, 6, 10]

#### list comprehension 적용 O 코드

- 형태 : 리스트 명 = [표현식 for 변수 in 반복 대상 if 조건문]

```python
num = [1, 2, 3, 4, 5]
double_odd_num = [2*i for i in num if (i% 2 == 1)]
double_odd_num
```

In [24]:
num = [1, 2, 3, 4, 5]
double_odd_num = [2*i for i in num if (i% 2 == 1)]
double_odd_num

[2, 6, 10]

# dictionary 응용

저번 시간에 dictionary의 기초에 대해 배웠습니다.<br> 이번 시간은 dictionary에서 많이 쓰이는 함수와, for문과 같이 연계하는 법을 배워보겠습니다.

#### dictionary 함수

In [25]:
# dic = {"name":"이상민", "school":"경희대", "age":24}

In [26]:
# dic.keys()

dict_keys(['name', 'school', 'age'])

In [27]:
# dic.values()

dict_values(['이상민', '경희대', 24])

In [30]:
# dic.items()

dict_items([('name', '이상민'), ('school', '경희대'), ('age', 24)])

#### dictionary key, value 탐색하기

- key 탐색

```python
for i in dic.keys():
    print(i)
```

In [29]:
for i in dic.keys():
    print(i)

name
school
age

- value 탐색

```python
for i in dic.keys():
    print(dic[i])
```

```python
for i in dic.values():
    print(i)
```

In [31]:
for i in dic.keys():
    print(dic[i])

이상민
경희대
24

In [33]:
for i in dic.values():
    print(i)

이상민
경희대
24

- key, value 동시 탐색

In [32]:
for k,v in dic.items():
    print('key:',k,'value:',v)

key: name value: 이상민
key: school value: 경희대
key: age value: 24

- 정렬하기

In [34]:
# dic={'a':2, 'b':3, 'c':1, 'd':7, 'e':5}
# dic

{'a': 2, 'b': 3, 'c': 1, 'd': 7, 'e': 5}

In [100]:
# sorted(a, key = lambda x : 정렬 기준)

# 나이를 기준으로 정렬
# sorted(dic.items(), key=lambda x:x[0])
# sorted(dic.items(), key=lambda x:x[1])

# Series

데이터 분석을 할 때, 많이 보게 되는 데이터 구조가 있습니다. 바로 Series와 DataFrame입니다.<br>

앞서 배운 list와 dictionary는 1행(가로행)으로 배열되어 있어 사람이 데이터를 보고 파악하기 힘듭니다. 그래서 행과 열이라는 형태로 나타내기 위해 Series와 DataFrame이 만들어졌습니다.<br>

먼저 Series에 대해 알아보겠습니다. Series를 이해하기 위한 가장 좋은 예시는 excel시트의 열 하나를 떠올리는 겁니다. 하지만 excel과 달리 Series는 행의 이름(index)와 열의 이름(column)을 원하는 대로 입력할 수 있습니다.

#### 패키지 불러오기

- import 패키지이름 as 축약

In [112]:
# 아래 두 개는 데이터 분석할 때, 습관처럼 입력
import numpy as np
import pandas as pd

#### Series 생성하기

#### 1) list
- Series([data value], index=[data index])

#### 2) dictionary
- Series({data index : data value})

In [114]:
# data1 = pd.Series([3,5,1,2])
data1 = pd.Series([3,5,1,2])
data1

0    3
1    5
2    1
3    2
dtype: int64

In [116]:
# 사전 타입의 데이터로 Series 생성
# data2 = pd.Series({'a':3, 'b':15, 'c':5, 'd':35})
data2 = pd.Series({'a':3, 'b':15, 'c':5, 'd':35})
data2

a     3
b    15
c     5
d    35
dtype: int64

In [117]:
# 값은 모든 데이터 타입 가능
# data3 = pd.Series(['big data', 30, [1,2,3]])
data3 = pd.Series(['big data', 30, [1,2,3]])
data3

0     big data
1           30
2    [1, 2, 3]
dtype: object

In [118]:
# Series 생성할 때 index 같이 생성
# data4 = pd.Series([3,15,5,35], index=['a','b','c','d'])
data4 = pd.Series([3,15,5,35], index=['a','b','c','d'])
data4

a     3
b    15
c     5
d    35
dtype: int64

#### Series 필수 함수

In [125]:
data2

a     3
b    15
c     5
d    35
dtype: int64

In [127]:
# type(data2) : data의 타입 확인 
type(data2)

pandas.core.series.Series

In [126]:
# dtypes : data 형태 반환
# data2.dtypes
data2.dtypes

dtype('int64')

In [129]:
# size : 크기 반환
# data2.size
data2.size

4

In [131]:
# Series.index : series index
# data3.index -> index를 뽑아내고 싶으면
# data3.index = ['수강명', '수강생수', '비고']
data3.index = ['수강명', '수강생수', '비고']
data3

수강명      big data
수강생수           30
비고      [1, 2, 3]
dtype: object

In [132]:
list('ABCDE')

['A', 'B', 'C', 'D', 'E']

In [133]:
data4 = pd.Series([10, -2, 3.5, 4.0, 8.0], index=list('ABCDE'))
data4

A    10.0
B    -2.0
C     3.5
D     4.0
E     8.0
dtype: float64

In [134]:
# values : 값 반환
# data4.values
data4.values

array([10. , -2. ,  3.5,  4. ,  8. ])

- 보통 수학과 관련된 함수에는 ()가 붙는다

In [135]:
# abs() : 절댓값
data4.abs()

A    10.0
B     2.0
C     3.5
D     4.0
E     8.0
dtype: float64

In [136]:
# max() : 최댓값
data4.max()

10.0

In [137]:
# min() : 최솟값
data4.min()

-2.0

In [138]:
# mean() : 평균
data4.mean()

4.7

In [140]:
# append()
data4.append(pd.Series({'F':2}))

A    10.0
B    -2.0
C     3.5
D     4.0
E     8.0
F     2.0
dtype: float64

In [141]:
# add() # 모든 요소에 더하기
data4.add(100)

A    110.0
B     98.0
C    103.5
D    104.0
E    108.0
dtype: float64

In [142]:
# describe()
data4.describe()

count     5.000000
mean      4.700000
std       4.631414
min      -2.000000
25%       3.500000
50%       4.000000
75%       8.000000
max      10.000000
dtype: float64

#### Series 데이터 접근하기

In [155]:
data4

A    10.0
B    -2.0
C     3.5
D     4.0
E     8.0
dtype: float64

In [158]:
# index 숫자로 접근
# python index는 0부터 시작
data4[2]

3.5

In [160]:
# index label로 Series 접근
data4['C']

3.5

In [163]:
# 숫자인덱스가 1,3,5인 항목 조회
data4[ [0,2,4] ]

A    10.0
C     3.5
E     8.0
dtype: float64

#### Series 응용

In [164]:
# list('abcdefghij')
list('abcdefghij')

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [165]:
# data5 = pd.Series([10,20,30,40,50,60,70,80,90,100], index=list('abcdefghij'))
data5 = pd.Series([10,20,30,40,50,60,70,80,90,100], index=list('abcdefghij'))
data5

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int64

In [166]:
# data5 = pd.Series([x for x in range(10,101,10)], index=list('abcdefghij'))
data5 = pd.Series([x for x in range(10,101,10)], index=list('abcdefghij'))
data5

a     10
b     20
c     30
d     40
e     50
f     60
g     70
h     80
i     90
j    100
dtype: int64

In [167]:
# 'a','c','f' 만 조회
data5[ ['a','c','f'] ]

a    10
c    30
f    60
dtype: int64

In [169]:
# 숫자 인덱스가 2,3,4,5인 항목 선택

# data5[ [2,3,4,5] ]
data5[2:6]

c    30
d    40
e    50
f    60
dtype: int64

In [170]:
# 맨 앞에 있는 5개의 항목 선택
data5[ :5 ]

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [172]:
# 뒤에서 2번째 항목 선택
data5[-2]
# data5[-2:-1]

90

In [64]:
# 가장 뒤에 있는 3개의 항목 선택
data5[-3:]

h     80
i     90
j    100
dtype: int64

In [65]:
# 뒤에서 3번째, 2번째 불러오기
data5[-3:-1]

h    80
i    90
dtype: int64

In [71]:
# index
# 반환형이 list
data6.index[:2]

Index(['A', 'B'], dtype='object')

In [66]:
# 인덱스 라벨이 'c'부터 'g'까지 항목 선택
data5['c':'g']

c    30
d    40
e    50
f    60
g    70
dtype: int64

In [67]:
# 조건을 활용한 인덱스 선택 (조건 색인)
# 데이터 분석에서 가장 중요한 부분이므로 반드시 기억해야함!
<img src="img/1강/조건색인.jpg" alt="datetime" style="width: 1000px;"/>

SyntaxError: invalid syntax (<ipython-input-67-3b94afed09f3>, line 3)

In [174]:
# 데이터 값이 70이상인 데이터만 불러오기
data5 >= 70
# data5[data5 >= 70]

a    False
b    False
c    False
d    False
e    False
f    False
g     True
h     True
i     True
j     True
dtype: bool

In [69]:
# 값이 30보다 크거나 같고, 70보다 작은 항목만 선택
# data5[(data5>=30) & (data5 < 70)]

c    30
d    40
e    50
f    60
dtype: int64

In [70]:
# data6 = pd.Series([10, -2, 3.5, 4.0, 8.0], index=list('ABCDE'))
data6

A    10.0
B    -2.0
C     3.5
D     4.0
E     8.0
dtype: float64

In [75]:
# loc(ation)
data6.loc['C']

3.5

In [76]:
# i(ndex)loc
data6.iloc[2]

3.5

# DataFrame

Series가 열 한개라면, DataFrame은 여러 열을 모아놓은 것을 말한다.

## 데이터프레임 생성
### 생성자 인자
- 1) data : dataFrame에 저장할 데이터
- 2) index : 행(row) 이름, 기본값 = 0부터 1씩 증가하는 정수
- 3) columns : 열(column) 이름, 기본값 = 0부터 1씩 증가하는 정수
- 4) dtype : 데이터 형태(type), 만약 지정하지 않으면 파이썬이 자동으로 값의 형태를 보고 결정
- 5) copy : 입력 데이터를 복사할지 지정. 디폴트는 False 임. (복사할 거 아니면 메모리 관리 차원에서 디폴트인 False 설정 사용하면 됨)

In [175]:
# 1. 2차원 데이터 생성
data = pd.DataFrame([ [1, 'kim', 26], [2, 'lee', 27] ])
data

   0    1   2
0  1  kim  26
1  2  lee  27

In [176]:
# row index 설정
data.index = ['A', 'B']
data

   0    1   2
A  1  kim  26
B  2  lee  27

In [177]:
# column index 설정
data.columns = ['순서', '이름', '나이']
data

   순서   이름  나이
A   1  kim  26
B   2  lee  27

```python
pd.DataFrame(data=[ [1, 'kim', 26], [2, 'lee', 27] ],
                     index=['A','B'],
                     columns=['order','name','age'])
```

In [178]:
# 1,2,3 한꺼번에 하기
pd.DataFrame(data=[ [1, 'kim', 26], [2, 'lee', 27] ],
                     index=['A','B'],
                     columns=['order','name','age'])

   order name  age
A      1  kim   26
B      2  lee   27

```python
population_dic = {'서울':[1053.5, 1023, 987],
                  '경기':[1023, 1067, 1123],
                  '충청':[512, 489, 487],
                  '경상':[897, 872, 811],
                  '전라':[451, 421, 399] }
population_dic
```

In [179]:
# 사전 타입 데이터를 이용하여 데이터 프레임 생성하기
population_dic = {'서울':[1053.5, 1023, 987],
                  '경기':[1023, 1067, 1123],
                  '충청':[512, 489, 487],
                  '경상':[897, 872, 811],
                  '전라':[451, 421, 399] }
population_dic

{'서울': [1053.5, 1023, 987],
 '경기': [1023, 1067, 1123],
 '충청': [512, 489, 487],
 '경상': [897, 872, 811],
 '전라': [451, 421, 399]}

In [180]:
data2 = pd.DataFrame(population_dic)
data2

       서울    경기   충청   경상   전라
0  1053.5  1023  512  897  451
1  1023.0  1067  489  872  421
2   987.0  1123  487  811  399

In [181]:
# row index를 2015, 2016, 2017로 만들기
data2.index = [x for x in range(2015, 2018)]
data2

          서울    경기   충청   경상   전라
2015  1053.5  1023  512  897  451
2016  1023.0  1067  489  872  421
2017   987.0  1123  487  811  399

## DataFrame 속성 조회하기 (속성을 조회할 때에는 ()를 사용하지 않으니 유의하기 바람.)

In [185]:
# T (Transpose) : 행과 열을 바꾸기.
data2.T

      2015    2016    2017
서울  1053.5  1023.0   987.0
경기  1023.0  1067.0  1123.0
충청   512.0   489.0   487.0
경상   897.0   872.0   811.0
전라   451.0   421.0   399.0

In [186]:
# axes : 행과 열 이름을 리스트로 반환
data2.axes

[Int64Index([2015, 2016, 2017], dtype='int64'),
 Index(['서울', '경기', '충청', '경상', '전라'], dtype='object')]

In [187]:
# dtypes : 데이터 형태 반환
data2.dtypes

서울    float64
경기      int64
충청      int64
경상      int64
전라      int64
dtype: object

In [188]:
# 참고
# float64 -> int64 data type 변경
data2['서울'] = data2['서울'].astype('int64')
data2

        서울    경기   충청   경상   전라
2015  1053  1023  512  897  451
2016  1023  1067  489  872  421
2017   987  1123  487  811  399

In [189]:
# shape : 행과 열의 개수(차원)을 튜플로 반환
#shape[0]행, shape[1]열
data2.shape

(3, 5)

In [190]:
# size : DataFrame의 원소의 개수를 반환
data2.size

15

In [191]:
# index : 데이터프레임의 인덱스를 리스트로 반환
data2.index

Int64Index([2015, 2016, 2017], dtype='int64')

In [192]:
# columns : 데이터프레임의 컬럼을 리스트로 반환
data2.columns

Index(['서울', '경기', '충청', '경상', '전라'], dtype='object')

In [193]:
# values : 데이터프레임의 값들을 반환
data2.values

array([[1053, 1023,  512,  897,  451],
       [1023, 1067,  489,  872,  421],
       [ 987, 1123,  487,  811,  399]], dtype=int64)

#### DataFrame 값 접근하기

- 행 접근

In [194]:
# 숫자 인덱스 하나 쓰면 접근X
data2[2]

KeyError: 2

In [195]:
# index slicing은 가능
data2[:2]

        서울    경기   충청   경상   전라
2015  1053  1023  512  897  451
2016  1023  1067  489  872  421

```python
df = pd.DataFrame( {'Class' : ['loT', 'Network', 'Economy', 'Big Data', 'Cloud'],
                      'Year' : [ 2018, 2017, 2018, 2018, 2019],
                      'Price' :[100, 125, 132, 312, 250],
                      'Location' : ['Korea', 'Korea', korea, 'US', 'France']},
                      index = ['C01', 'C02', 'C03', 'C04', 'C05'])

```

In [207]:
df = pd.DataFrame( {'Class' : ['loT', 'Network', 'Economy', 'Big Data', 'Cloud'],
                      'Year' : [ 2018, 2017, 2018, 2018, 2019],
                      'Price' :[100, 125, 132, 312, 250],
                      'Location' : ['Korea', 'Korea', 'Korea', 'US', 'France']},
                      index = ['C01', 'C02', 'C03', 'C04', 'C05'])

df

        Class  Year  Price Location
C01       loT  2018    100    Korea
C02   Network  2017    125    Korea
C03   Economy  2018    132    Korea
C04  Big Data  2018    312       US
C05     Cloud  2019    250   France

In [208]:
# index label 하나로 접근 x
df['CO1']

KeyError: 'CO1'

- 열 접근

In [210]:
# 열로 접근하고 싶으면 column명을 직접 입력
# Price 정보만 조회하기
df['Price']

C01    100
C02    125
C03    132
C04    312
C05    250
Name: Price, dtype: int64

In [211]:
# Class와 Year 컬럼만 조회
# 여러 개의 컬럼들을 조회하기 위해서는 컬럼명들을 리스트로 선언해야 함.
df[['Class','Year']]

        Class  Year
C01       loT  2018
C02   Network  2017
C03   Economy  2018
C04  Big Data  2018
C05     Cloud  2019

#### loc를 통한 접근
loc는 특정 name을 지정해줘야함

- 행 접근

In [212]:
# 행을 row로 접근하여 조회하기
# row index가 'C04'인 경우만 조회하기
df.loc['C01']

Class         loT
Year         2018
Price         100
Location    Korea
Name: C01, dtype: object

In [213]:
# row label로 slicing (start index와 end index 모두 포함)
# :로 접근
df.loc['C01':'C03']

       Class  Year  Price Location
C01      loT  2018    100    Korea
C02  Network  2017    125    Korea
C03  Economy  2018    132    Korea

In [214]:
# C01, C03 추출
#loc를 생략하면 KeyError 발생
df.loc[['C01','C03']]

       Class  Year  Price Location
C01      loT  2018    100    Korea
C03  Economy  2018    132    Korea

- 열 접근

In [215]:
# Price 정보만 조회하기
df.loc[:,'Price'] # df['Price']

C01    100
C02    125
C03    132
C04    312
C05    250
Name: Price, dtype: int64

In [216]:
# Class와 Year 컬럼만 조회
df.loc[:,['Class','Year']] # df[['Class','Year']]

        Class  Year
C01       loT  2018
C02   Network  2017
C03   Economy  2018
C04  Big Data  2018
C05     Cloud  2019

In [217]:
# 특정 컬럼과 로우를 동시에 인덱싱하기
# C02, C03 강의의 Class와 Year, Price 정보만 조회
df.loc[ ['C02', 'C03'], ['Class','Year','Price']]

       Class  Year  Price
C02  Network  2017    125
C03  Economy  2018    132

#### iloc를 통한 접근
i는 index를 의미하며 숫자를 통해 접근

- 행 접근

In [218]:
# 행을 숫자 index로 접근하여 조회하기 (iloc)
df.iloc[2]

Class       Economy
Year           2018
Price           132
Location      Korea
Name: C03, dtype: object

In [219]:
# row index로 slicing (start index와 end index 모두 포함)
df.iloc[:2]

       Class  Year  Price Location
C01      loT  2018    100    Korea
C02  Network  2017    125    Korea

- 열 접근

In [220]:
# Class와 Year, Price 정보만 조회
df.iloc[:, :3]

        Class  Year  Price
C01       loT  2018    100
C02   Network  2017    125
C03   Economy  2018    132
C04  Big Data  2018    312
C05     Cloud  2019    250

In [221]:
# C02, C03 강의의 Class와 Year, Price 정보만 조회
df.iloc[1:3, :3]

       Class  Year  Price
C02  Network  2017    125
C03  Economy  2018    132

#### 조건 indexing

In [222]:
# Price의 값이 200보다 큰 경우만 조회하기
#df[df['Price']>200]
df[df.Price>200]

        Class  Year  Price Location
C04  Big Data  2018    312       US
C05     Cloud  2019    250   France

In [223]:
# 아래 결과들이 출력되도록 코드를 완성하시오.
# 실습 1. 'Location' 컬럼만 조회

# 그냥 접근
df['Location']  #나는 이거 씀
# loc를 통해 접근
df.loc[:,'Location']
# iloc를 통해 접근
df.iloc[:,3:]

    Location
C01    Korea
C02    Korea
C03    Korea
C04       US
C05   France

In [224]:
# 실습 2. 'Class'와 'Price' 컬럼만 조회

# 그냥 접근
df[['Class','Price']]
# loc를 통해 접근
df.loc[:,['Class','Price']]
# iloc를 통해 접근
df.iloc[:,[0,2]] #행 접근할 때 많이 쓰임

        Class  Price
C01       loT    100
C02   Network    125
C03   Economy    132
C04  Big Data    312
C05     Cloud    250

In [225]:
# 실습 3. C01과 C03 강의의 모든 컬럼 조회

df[:3]
# loc를 통해 접근
df.loc[['C01','C03'],:]
# iloc를 통해 접근
df.iloc[[0,2],:]

       Class  Year  Price Location
C01      loT  2018    100    Korea
C03  Economy  2018    132    Korea

In [226]:
# 실습 4. C01~C03 강의의 Class와 Price만 조회


# loc를 통해 접근
df.loc['C01':'C03',['Class','Price']]
# iloc를 통해 접근
df.iloc[:3,[0,2]]

       Class  Price
C01      loT    100
C02  Network    125
C03  Economy    132

In [227]:
# 실습 5. Year가 2018이고, Price가 200 미만인 강의만 조회
df[(df.Year == 2018) & (df.Price<200)]

       Class  Year  Price Location
C01      loT  2018    100    Korea
C03  Economy  2018    132    Korea

#### 데이터프레임에 새로운 컬럼 추가하기

In [228]:
# 컬럼 추가하기 1.
# numStudent 컬럼 추가하고, 값을 10으로 저장
df['numStudent'] = 10
df

        Class  Year  Price Location  numStudent
C01       loT  2018    100    Korea          10
C02   Network  2017    125    Korea          10
C03   Economy  2018    132    Korea          10
C04  Big Data  2018    312       US          10
C05     Cloud  2019    250   France          10

In [229]:
# numStudent 의 값을 15, 30, 26, 32, 50으로 변경
df['numStudent'] = [15,30,26,32,50]
df

        Class  Year  Price Location  numStudent
C01       loT  2018    100    Korea          15
C02   Network  2017    125    Korea          30
C03   Economy  2018    132    Korea          26
C04  Big Data  2018    312       US          32
C05     Cloud  2019    250   France          50

In [230]:
# 컬럼 추가하기 2 - 기존 컬럼을 이용하여 새 컬럼 추가하기
# Price과 numStudent의 값을 곱한 값을 'Income'라는 새 컬럼으로 추가
df['income'] = df['Price'] * df['numStudent']
df

        Class  Year  Price Location  numStudent  income
C01       loT  2018    100    Korea          15    1500
C02   Network  2017    125    Korea          30    3750
C03   Economy  2018    132    Korea          26    3432
C04  Big Data  2018    312       US          32    9984
C05     Cloud  2019    250   France          50   12500

#### 데이터프레임 로우, 컬럼 삭제

In [231]:
# drop() 함수 사용 (원본 변경 X)
## 첫번째 인자 - 지우고자 하는 인덱스명 (로우 인덱스, 컬럼 인덱스 모두 가능)
## 두번째 인자 (axis)- 0 혹은 1. 0 = 로우 삭제, 1 = 컬럼 삭제
df.drop(['numStudent'],axis=1)    #axis는 축

        Class  Year  Price Location  income
C01       loT  2018    100    Korea    1500
C02   Network  2017    125    Korea    3750
C03   Economy  2018    132    Korea    3432
C04  Big Data  2018    312       US    9984
C05     Cloud  2019    250   France   12500

In [232]:
# 'Income' 컬럼 삭제
df.drop(['income'], axis=1)

        Class  Year  Price Location  numStudent
C01       loT  2018    100    Korea          15
C02   Network  2017    125    Korea          30
C03   Economy  2018    132    Korea          26
C04  Big Data  2018    312       US          32
C05     Cloud  2019    250   France          50

In [233]:
# inplace=True option 부여
df.drop(['numStudent'],axis=1,inplace=True)

In [234]:
# 여러 index를 한 번에 지우기 위해서는 list로 column name을 인자로 넘김
df.drop(['Class','Year'],axis=1, inplace=True)
df

     Price Location  income
C01    100    Korea    1500
C02    125    Korea    3750
C03    132    Korea    3432
C04    312       US    9984
C05    250   France   12500